package com.mystudy.string;

public class Ex04_String_array_exam_01 {

	public static void main(String[] args) {
		
		
	System.out.println("[선생님이 만든 코드]");
	



	/* 배열 String[]과 String 메소드 사용 실습
	문자열 : "홍길동","이순신","이순신","을지문덕","김유신","연개소문","Tom","TOM"
	1. 위의 문자열 값을 저장할 수 있는 String 배열(names) 변수를 선언하고 입력
	2. 배열에 있는 값을 구분자 콤마(,)로 구분하여 한 라인에 출력
	   출력 예) 홍길동,이순신,이순신,을지문덕....
	3. 배열에 있는 데이터의 첫 글자만 출력-구분자 콤마(,) 사용 한 라인에 출력
	   출력 예) 홍,이,이,을,김,연,T,T
	4. 이름의 글자수가 4글자 이상인 이름을 검색해서 "인덱스번호:이름" 형태로 출력
	   예) 3:을지문덕
	========================= */

	
	
	// 1.
	
	
	
	
	
	
	

}
}
